views/balance/index.php

SELECT * FROM `source` WHERE type=1 ORDER BY `name`
---
            [
                'attribute' => 'source',
                'value' => 'source.name',
                'filter' => Html::activeDropDownList($searchModel, 'id_source', ArrayHelper::map(
                    Source::find()->where('type=1')->orderBy(['name' => SORT_ASC])->asArray()->all(), 'id', 'name'
                ),['class'=>'form-control','prompt' => 'All source']),