views/source-spend/index.php

SELECT * FROM `source` WHERE type=1 ORDER BY `name`
---
            }
        },
        'filterModel' => $searchModel,
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],
            [
                'attribute' => 'source',
                'value' => 'source.name',
                'filter' => Html::activeDropDownList($searchModel, 'id_source', ArrayHelper::map(
                    Source::find()->where('type=1')->orderBy(['name' => SORT_ASC])->asArray()->all(), 'id', 'name'
                ),['class'=>'form-control','prompt' => 'All sources']),
            ],
            [
                'attribute' => 'user',
                'value' => 'user.name',
                'filter' => Html::activeDropDownList($searchModel, 'id_user', ArrayHelper::map(
                    Users::find()->orderBy(['name' => SORT_ASC])->asArray()->all(), 'id', 'name'
                ),['class'=>'form-control','prompt' => 'All users']),
            ],
            'date',
            'spend',
            'date_create',
            ['class' => 'yii\grid\ActionColumn'],
        ],